In [1]:
import numpy as np
import pandas as pd
heroes = pd.read_csv("heroes_information.csv")

In [2]:
###instalar desde anaconda navigator######
from pandasql import *

In [3]:
pysqldf = lambda q: sqldf(q,globals())

In [53]:
query = " SELECT * FROM heroes limit 10"

In [54]:
pysqldf(query)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,None,good,441.0
1,1,Abe Sapien,Male,blue,Icthyo Sapien,No Hair,191.0,Dark Horse Comics,blue,good,65.0
2,2,Abin Sur,Male,blue,Ungaran,No Hair,185.0,DC Comics,red,good,90.0
3,3,Abomination,Male,green,Human / Radiation,No Hair,203.0,Marvel Comics,None,bad,441.0
4,4,Abraxas,Male,blue,Cosmic Entity,Black,-99.0,Marvel Comics,None,bad,-99.0
5,5,Absorbing Man,Male,blue,Human,No Hair,193.0,Marvel Comics,None,bad,122.0
6,6,Adam Monroe,Male,blue,None,Blond,-99.0,NBC - Heroes,None,good,-99.0
7,7,Adam Strange,Male,blue,Human,Blond,185.0,DC Comics,None,good,88.0
8,8,Agent 13,Female,blue,None,Blond,173.0,Marvel Comics,None,good,61.0
9,9,Agent Bob,Male,brown,Human,Brown,178.0,Marvel Comics,None,good,81.0

In [15]:
query1 = " SELECT name FROM heroes limit 1"

In [16]:
pysqldf(query1)

     name
0  A-Bomb

In [29]:
query2 = " SELECT COUNT(DISTINCT(Publisher)) FROM heroes"

In [30]:
pysqldf(query2)

   COUNT(DISTINCT(Publisher))
0                          24

In [23]:
query3 = " SELECT COUNT(Height) FROM heroes WHERE Height > 200 "

In [24]:
pysqldf(query3)

   COUNT(Height)
0             59

In [45]:
query4 = " SELECT COUNT(Height) FROM heroes WHERE Height > 200 AND Race = 'Human' "

In [46]:
pysqldf(query4)

   COUNT(Height)
0             12

In [49]:
query5 = "SELECT COUNT(Weight) FROM heroes WHERE Weight > 100 AND Weight < 200"

In [50]:
pysqldf(query5)

   COUNT(Weight)
0             98

In [65]:
query6 =  "SELECT COUNT()FROM heroes WHERE `Eye color` IN ('blue', 'red')"

In [66]:
pysqldf(query6)

   COUNT()
0      271

In [75]:
query7 =  "SELECT COUNT(Race) FROM heroes WHERE (Race in ('Human', 'Mutant') AND `Hair color` = 'Green') OR (Race = 'Vampire' AND `Hair color` = 'Black')"

In [76]:
pysqldf(query7)

   COUNT(Race)
0            5

In [77]:
query8 =  "Select name FROM heroes ORDER BY Race DESC"

In [78]:
pysqldf(query8)

               name
0    Solomon Grundy
1            Gamora
2              Yoda
3          Predator
4             Alien
..              ...
729          Wondra
730  Wyatt Wingfoot
731           X-Man
732     Yellow Claw
733            Zoom

[734 rows x 1 columns]

In [85]:
query9 =  "SELECT Gender, COUNT(Gender) FROM heroes GROUP BY (Gender)"

In [86]:
pysqldf(query9)

   Gender  COUNT(Gender)
0    None              0
1  Female            200
2    Male            505

query10 = "SELECT Publisher FROM heroes GROUP BY (Publisher) HAVING COUNT (Publisher) >15"

In [89]:
pysqldf(query10)

           Publisher
0          DC Comics
1  Dark Horse Comics
2      Marvel Comics
3       NBC - Heroes